In [1]:
# Importamos pandas

import pandas as pd

# Actividades de Merge y Join:

In [2]:
# Crea un dataframe de clientes y almacenalo en una variable llamada clientes

lista_clientes = [(1, "Juan", 30),(2, "María", 25),(3, "Pedro", 40),(4, "Laura", 35 ),(5, "Ana", 28)]
columnas1 = ("cliente_id","nombre","edad")

clientes = pd.DataFrame(lista_clientes, columns=columnas1)
clientes

   cliente_id nombre  edad
0           1   Juan    30
1           2  María    25
2           3  Pedro    40
3           4  Laura    35
4           5    Ana    28

In [3]:
# Crea un dataframe de pedidos realizados por esos clientes y almacenalos en una variable llamada pedidos

lista_pedidos = [(101, 2, "Camisa", 2),(102,  4, "Pantalón", 1),(103, 1, "Zapatos", 3),(104, 3, "Bolso", 2 ),(105, 5, "Sombrero", 1)]
columnas2 = ("pedido_id", "cliente_id","producto","cantidad")

pedidos = pd.DataFrame(lista_pedidos, columns=columnas2)
pedidos

   pedido_id  cliente_id  producto  cantidad
0        101           2    Camisa         2
1        102           4  Pantalón         1
2        103           1   Zapatos         3
3        104           3     Bolso         2
4        105           5  Sombrero         1

In [4]:
# Realizar el merge basándote en la id de los clientes y almacena el dataframe resultante en una varaible llamada merge_df

merge_df = clientes.merge(pedidos, on="cliente_id") 
merge_df

   cliente_id nombre  edad  pedido_id  producto  cantidad
0           1   Juan    30        103   Zapatos         3
1           2  María    25        101    Camisa         2
2           3  Pedro    40        104     Bolso         2
3           4  Laura    35        102  Pantalón         1
4           5    Ana    28        105  Sombrero         1

Hint:
- La combinación inner devuelve solo las filas que tienen coincidencias en ambos DataFrames.
- La combinación outer devuelve todas las filas de ambos DataFrames y rellena los valores faltantes con NaN en caso de no haber coincidencias.
- La combinación left devuelve todas las filas del DataFrame izquierdo y las filas coincidentes del DataFrame derecho.
- La combinación right devuelve todas las filas del DataFrame derecho y las filas coincidentes del DataFrame izquierdo.

Probemos estas combinaciones con otros dos dataframes:

In [5]:
# Crea un DataFrame de empleados y almacenalos en una variable llamada empleados

lista_empleados = [(1, "Juan", "Ventas"),(2, "María", "Marketing"),(3, "Pedro", "Ventas"),(4, "Laura", "Finanzas"),(5, "Ana","Marketing")]
columnas3 = ("empleado_id", "nombre","departamento")

empleados = pd.DataFrame(lista_empleados, columns=columnas3)
empleados

   empleado_id nombre departamento
0            1   Juan       Ventas
1            2  María    Marketing
2            3  Pedro       Ventas
3            4  Laura     Finanzas
4            5    Ana    Marketing

In [6]:
# Crea un DataFrame de salarios que registre los salarios de ALGUNOS empleados y almacenalo en una variable llamada salarios

lista_salarios = [(2, 3000),(4, 4000),(6, 5000 )]
columnas4 = ("empleado_id", "salario")

salarios = pd.DataFrame(lista_salarios, columns=columnas4)
salarios

   empleado_id  salario
0            2     3000
1            4     4000
2            6     5000

In [7]:
# Crea un dataframe a partir de empleados y salarios de modo que tengamos los datos completos coincidentes en ambos Dataframes. (Nombre variable libre)

merge_df2 = salarios.merge(empleados, on="empleado_id", how="inner")
merge_df2

   empleado_id  salario nombre departamento
0            2     3000  María    Marketing
1            4     4000  Laura     Finanzas

In [8]:
# Crea un dataframe a partir de empleados y salarios de modo que tengamos los salarios de todos los empleados. Si no hay salario registrado automáticamente saldrá NaN (Nombre variable libre)

merge_df3 = empleados.merge(salarios, on="empleado_id", how="outer")
merge_df3

   empleado_id nombre departamento  salario
0            1   Juan       Ventas      NaN
1            2  María    Marketing   3000.0
2            3  Pedro       Ventas      NaN
3            4  Laura     Finanzas   4000.0
4            5    Ana    Marketing      NaN
5            6    NaN          NaN   5000.0

In [9]:
# Crea un dataframe a partir de empleados y salarios de modo que tengamos los salarios de todos los datos posibles de los empleados 
#   cuya ID aparece en la tabla empleados. (Nombre variable libre)

merge_df4 = empleados.merge(salarios, on="empleado_id", how="left")
merge_df4

   empleado_id nombre departamento  salario
0            1   Juan       Ventas      NaN
1            2  María    Marketing   3000.0
2            3  Pedro       Ventas      NaN
3            4  Laura     Finanzas   4000.0
4            5    Ana    Marketing      NaN

In [10]:
# Crea un dataframe a partir de empleados y salarios de modo que tengamos los salarios de todos los datos posibles de los empleados cuya ID aparece en la tabla salarios. (Nombre variable libre)

merge_df5 = empleados.merge(salarios, on="empleado_id", how="right")
merge_df5

   empleado_id nombre departamento  salario
0            2  María    Marketing     3000
1            4  Laura     Finanzas     4000
2            6    NaN          NaN     5000

Hint:
- Join Inner (por defecto): Devuelve solo las filas que tienen coincidencias en ambos DataFrames. Se utiliza el método join() sin especificar el parámetro how (o how='inner').

- Join Outer (Full): Devuelve todas las filas de ambos DataFrames y rellena los valores faltantes con NaN en caso de no haber coincidencias. Se utiliza how='outer'.

- Join Left: Devuelve todas las filas del DataFrame izquierdo y las filas coincidentes del DataFrame derecho. Se utiliza how='left'.

- Join Right: Devuelve todas las filas del DataFrame derecho y las filas coincidentes del DataFrame izquierdo. Se utiliza how='right'.

- Join utilizando sufijos: Si los DataFrames tienen columnas con el mismo nombre, se pueden especificar sufijos para diferenciarlas en el resultado. Se utiliza el parámetro suffixes para agregar sufijos a las columnas en conflicto.

Practiquemos:

In [11]:
# Crea un dataframe de empleos de personas y almacenalo en una variable llamada empleos

lista_empleos = [(1, "Dentista"),(2, "Profesora"),(3, "Cocinero"),(4, "Camarera")]
columnas5 = ("ID","Empleo")

empleos = pd.DataFrame(lista_empleos, columns=columnas5)
empleos

   ID     Empleo
0   1   Dentista
1   2  Profesora
2   3   Cocinero
3   4   Camarera

In [12]:
# Crea un dataframe número de hijos de persona y almacenalo en una variable llamada hijos (sólo deben coincidir algunas IDs con la tabla empleos)

lista_hijos = [(1,0 ),(2,2 ),(8, 3),(10,0 )]
columnas6 = ("ID","Num_hijos")

hijos = pd.DataFrame(lista_hijos, columns=columnas6)
hijos

   ID  Num_hijos
0   1          0
1   2          2
2   8          3
3  10          0

In [13]:
# Establece la columna ID en ambos Dataframes como el índice (recuerda a nuestros amigos inplace y drop)

empleos.set_index("ID", inplace=True)
hijos.set_index("ID", inplace=True)

In [14]:
# Por ejemplo empleos se vería así
empleos

       Empleo
ID
1    Dentista
2   Profesora
3    Cocinero
4    Camarera

In [15]:
# Crea un Dataframe donde estén todas las personas de la tabla empleo y se refleje el número de hijos de cada uno (tendremos NaNs)

empleos_hijos = empleos.join(hijos, on="ID")
empleos_hijos

       Empleo  Num_hijos
ID
1    Dentista        0.0
2   Profesora        2.0
3    Cocinero        NaN
4    Camarera        NaN

In [16]:
# Obtén el mismo resultado pero usando el argumento "how"

empleos_hijos2 = empleos.join(hijos, on="ID", how='left')
empleos_hijos2

       Empleo  Num_hijos
ID
1    Dentista        0.0
2   Profesora        2.0
3    Cocinero        NaN
4    Camarera        NaN

In [17]:
# Crea un Dataframe donde estén todas las personas de AMBAS tablas (tendremos NaNs)

empleos_hijos3 = empleos.join(hijos, how='outer')
empleos_hijos3

       Empleo  Num_hijos
ID
1    Dentista        0.0
2   Profesora        2.0
3    Cocinero        NaN
4    Camarera        NaN
8         NaN        3.0
10        NaN        0.0

In [18]:
# Y ahora que pasaría se tienemos nombre de columna en ambas tablas que se llaman igual por ejemplo Ciudad?
empleos['Ciudad'] = ['Madrid','Barcelona','Valencia','Sevilla']
hijos['Ciudad'] = ['Madrid','Barcelona','Matalascañas','Palencia']

In [19]:
# Haz uso de los sufijos para indicar la ciudad de la tabla empleo y ciudad de la taba hijos; haz un outer join

empleos_hijos4 = empleos.join(hijos, how='outer',lsuffix = "_empleos",rsuffix = "_hijos")
empleos_hijos4

       Empleo Ciudad_empleos  Num_hijos  Ciudad_hijos
ID
1    Dentista         Madrid        0.0        Madrid
2   Profesora      Barcelona        2.0     Barcelona
3    Cocinero       Valencia        NaN           NaN
4    Camarera        Sevilla        NaN           NaN
8         NaN            NaN        3.0  Matalascañas
10        NaN            NaN        0.0      Palencia

## Ejercicio extra I:

Tu objetivo es combinar estos conjuntos de datos para obtener un DataFrame final que muestre la siguiente información:

Columnas: "estudiante_id", "nombre", "edad", "materia" y "calificacion".

Filas: Todas las filas que se puedan obtener al combinar los datos de ambos conjuntos.

Debes realizar la combinación de datos de manera que se incluyan todos los estudiantes, independientemente de si tienen o no calificaciones registradas.

Utiliza el método adecuado (merge o join) y la combinación correspondiente (inner, outer, left o right) para lograr esto.

In [20]:
# DataFrame de estudiantes
estudiantes = pd.DataFrame({
    'estudiante_id': [1, 2, 3, 4, 5],
    'nombre': ['Juan', 'María', 'Pedro', 'Laura', 'Ana'],
    'edad': [20, 22, 21, 19, 20]
})

# DataFrame de calificaciones
calificaciones = pd.DataFrame({
    'estudiante_id': [1, 3, 4, 6, 7],
    'materia': ['Matemáticas', 'Historia', 'Inglés', 'Matemáticas', 'Ciencias'],
    'calificacion': [85, 90, 78, 92, 88]
})

In [21]:
# Tu código para alcanzar el resultado deseado

ee1 = estudiantes.merge(calificaciones, on="estudiante_id", how="outer")
ee1

   estudiante_id nombre  edad      materia  calificacion
0              1   Juan  20.0  Matemáticas          85.0
1              2  María  22.0          NaN           NaN
2              3  Pedro  21.0     Historia          90.0
3              4  Laura  19.0       Inglés          78.0
4              5    Ana  20.0          NaN           NaN
5              6    NaN   NaN  Matemáticas          92.0
6              7    NaN   NaN     Ciencias          88.0

## Ejercicio extra II:
Tienes tres conjuntos de datos que contienen información sobre ventas realizadas por diferentes vendedores. Los conjuntos de datos son los siguientes:

- DataFrame "vendedores" con las columnas "vendedor_id", "nombre" y "ciudad".
- DataFrame "ventas" con las columnas "venta_id", "vendedor_id" y "monto".
- DataFrame "clientes" con las columnas "cliente_id", "nombre" y "ciudad".

Tu objetivo es combinar estos conjuntos de datos para obtener un DataFrame final que muestre la siguiente información:

- Columnas: "vendedor_id", "nombre", "ciudad", "venta_id", "monto", "cliente_id".
- Filas: Todas las filas que se puedan obtener al combinar los datos de los tres conjuntos.

Debes realizar la combinación de datos de manera que se incluyan todas las ventas realizadas, independientemente de si tienen o no información de vendedor o cliente asociada. Utiliza el método y la combinación adecuada para lograr esto.

In [22]:
# DataFrame de vendedores
vendedores = pd.DataFrame({
    'vendedor_id': [1, 2, 3, 4, 5],
    'nombre': ['Juan', 'María', 'Pedro', 'Laura', 'Ana'],
    'ciudad': ['Madrid', 'Barcelona', 'Madrid', 'Valencia', 'Barcelona']
})

# DataFrame de ventas
ventas = pd.DataFrame({
    'venta_id': [1, 2, 3, 4, 5],
    'vendedor_id': [1, 2, 4, 3, 6],
    'monto': [1000, 1500, 2000, 1200, 1800]
})

# DataFrame de clientes
clientes = pd.DataFrame({
    'cliente_id': [1, 2, 3, 4, 5],
    'nombre': ['Carlos', 'Elena', 'Pedro', 'Laura', 'Ana'],
    'ciudad': ['Madrid', 'Barcelona', 'Sevilla', 'Valencia', 'Barcelona']
})

In [23]:
# Tu código para alcanzar el resultado deseado (Hint:Quizás la solución sea un merge de otro merge)

ee2 = (vendedores.merge(ventas, on="vendedor_id", how="outer")).merge(clientes, on="nombre", how="outer")
ee2

   vendedor_id  nombre   ciudad_x  venta_id   monto  cliente_id   ciudad_y
0          1.0    Juan     Madrid       1.0  1000.0         NaN        NaN
1          2.0   María  Barcelona       2.0  1500.0         NaN        NaN
2          3.0   Pedro     Madrid       4.0  1200.0         3.0    Sevilla
3          4.0   Laura   Valencia       3.0  2000.0         4.0   Valencia
4          5.0     Ana  Barcelona       NaN     NaN         5.0  Barcelona
5          6.0     NaN        NaN       5.0  1800.0         NaN        NaN
6          NaN  Carlos        NaN       NaN     NaN         1.0     Madrid
7          NaN   Elena        NaN       NaN     NaN         2.0  Barcelona

# Actividades de Multiindex:

## Creación de Multiindex usando el método from_arrays()

In [24]:
# Creamos una lista de listas para los niveles del MultiIndex

arrays = [[1, 1, 2, 2], ['A', 'B', 'A', 'B']]

# Creamos el MultiIndex utilizando el método .from_arrays()

MultiIndex = pd.MultiIndex.from_arrays(arrays, names=('Planta', 'Puerta'))

# Muestralo

MultiIndex

MultiIndex([(1, 'A'),
            (1, 'B'),
            (2, 'A'),
            (2, 'B')],
           names=['Planta', 'Puerta'])

## Creación de dataframes con Multiindex:
Vamos a crear un pequeño ejemplo para las edades de los vecinos de un edificio de 2 plantas. El edificio tedrá planta 1 y planta 2; cada planta tiene puerta A y puerta B (supongamos que en cada casa vive solo una persona y que tan sólo vamos a registrar la edad de cada vecino en una sola columna).

In [25]:
# Creamos una lista de tuplas en la que cada tupla es el número de la planta y la letra de la puerta y la almacenamos en la variable niveles

niveles = [(1, "A"), ( 1, "B"), (2, "A"), (2, "B")]

In [26]:
# Creamos el MultiIndex utilizando el método from_tuples y lo almacenamos en la variable multiindex

multiindex = pd.MultiIndex.from_tuples(niveles)
multiindex

MultiIndex([(1, 'A'),
            (1, 'B'),
            (2, 'A'),
            (2, 'B')],
           )

In [27]:
# Creamos una lista de edades inventadas para cada vecino del edificio y la almacenamos en una variable llamada edades


edades = [35,20,30,40]

In [28]:
# Juntamos todo creando un dataframe y almacenándolo en la variable df_multiidx

df_multiidx = pd.DataFrame(edades, index = multiindex, columns = ["Edades"])
df_multiidx

     Edades
1 A      35
  B      20
2 A      30
  B      40

In [29]:
# Muestra el valor de la edad para el vecino que vive en el segundo A

df_multiidx.loc[(2, "A")]

Edades    30
Name: (2, A), dtype: int64

In [30]:
# Realiza el mismo ejercicio pero esta vez usando el método from_product:
# Creamos una lista de valores para cada nivel del MultiIndex llamadas nivel1 y nivel2

nivel1 = [1, 2]
nivel2 = ["A", "B"]
# Creamos el MultiIndex utilizando el método from_product

multiindex1 = pd.MultiIndex.from_product([nivel1,nivel2])
multiindex1

MultiIndex([(1, 'A'),
            (1, 'B'),
            (2, 'A'),
            (2, 'B')],
           )

In [31]:
# Creamos una lista de edades inventadas para cada vecino del edificio y la almacenamos en una variable llamada edades


# Juntamos todo creando un dataframe y almacenándolo en la variable df_multiidx

df_multiidx1 =  pd.DataFrame(edades, index = multiindex, columns = ["Edades"])
df_multiidx1

     Edades
1 A      35
  B      20
2 A      30
  B      40

## Set_index y sort_index:

In [32]:
# Creamos un DataFrame de ejemplo desordenado
df = pd.DataFrame({'Planta': [2, 2, 1, 1],
                   'Puerta': ['B', 'A', 'A', 'B'],
                   'Valor1': [10, 20, 30, 40],
                   'Valor2': [50, 60, 70, 80]})

In [33]:
# Utilizamos el método set_index para establecer 'Nivel1' y 'Nivel2' como índices

df.set_index(["Planta", "Puerta"], inplace=True)

# La jerarquía de los nuevos índices dependerá del orden en la que se nombren las columnas en la lista.

# Mostramos el DataFrame resultante
df

               Valor1  Valor2
Planta Puerta
2      B           10      50
       A           20      60
1      A           30      70
       B           40      80

In [34]:
# Ordenamos el Dataframe por sus indices

df.sort_index( inplace=True)
# Muestralo

df

               Valor1  Valor2
Planta Puerta
1      A           30      70
       B           40      80
2      A           20      60
       B           10      50

## Ejercicio extra III (dificultad un poco alta):
Creación de un Multiindex a partir de un dataframe usando from_frame() y estableciendolos a nivel de COLUMNA (no filas como hemos hecho hasta ahora):

In [35]:
# Creamos un DataFrame con columnas que representan los niveles del MultiIndex y los valores, llámalo df_data
df_data = pd.DataFrame({'Piso': [1,1,2,2],
                   'Puerta': ['A', 'B', 'A', 'B'],
                   'Edad': [10, 20, 30, 40]})
df_data

   Piso Puerta  Edad
0     1      A    10
1     1      B    20
2     2      A    30
3     2      B    40

In [36]:
# Creamos el MultiIndex utilizando el método from_frame (usa el dataframe que acabas de crear), guardalo en una variable llamada multiindex

edades1 = df_data["Edad"].to_list()
del(df_data["Edad"])
multiindex2 = pd.MultiIndex.from_frame(df_data)
multiindex2

MultiIndex([(1, 'A'),
            (1, 'B'),
            (2, 'A'),
            (2, 'B')],
           names=['Piso', 'Puerta'])

In [37]:
# Creamos el DataFrame con las edades y el MultiIndex de columnas

df_multiidx2 =  pd.DataFrame(edades1, index = multiindex2).T
df_multiidx2

Piso     1       2
Puerta   A   B   A   B
0       10  20  30  40

In [38]:
# Muestra la edad del vecino del primero B

df_multiidx2[(1, "B")]

0    20
Name: (1, B), dtype: int64